Revit 2015 API
BuiltInFailures.KeyBasedTreeEntryFailures.BadClassificationCategoryId Property
 Category id [CategoryId] of Classification [Code] is not Revit built in category id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public static FailureDefinitionId BadClassificationCategoryId { get; }
Visual Basic
Public Shared ReadOnly Property BadClassificationCategoryId As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BadClassificationCategoryId {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace